Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: ثم أتبع سببا
en: Then he followed a way

source: حتى إذا بلغ مطلع الشمس وجدها تطلع على قوم لم نجعل لهم من دونها سترا
en: Until, when he came to the rising of the sun, he found it rising on a people for whom We had not made against it any shield.

source: كذلك وقد أحطنا بما لديه خبرا
en: Thus. And We had encompassed [all] that he had in knowledge.

source: حتى إذا بلغ بين السدين وجد من دونهما قوما لا يكادون يفقهون قولا
en: Until, when he reached [a pass] between two mountains, he found beside them a people who could hardly understand [his] speech.

source: قالوا يا ذا القرنين إن يأجوج ومأجوج مفسدون في الأرض فهل نجعل لك خرجا على أن تجعل بيننا وبينهم سدا
en: They said, "O Dhul-Qarnayn, indeed Gog and Magog are [great] corrupters in the land. So may we assign for you an expenditure that you might make between us and them a barrier?"

source: قال ما مكني فيه ربي خير فأعينوني بقوة أجعل بينكم وبينهم ردما
en: He said, "That in which my Lord has established me is better [than what you offer], but assist me with strength; I will make between you and them a dam.

source: آتوني زبر الحديد حتى إذا ساوى بين الصدفين قال انفخوا حتى إذا جعله نارا قال آتوني أفرغ عليه قطرا
en: Bring me sheets of iron" - until, when he had leveled [them] between the two mountain walls, he said, "Blow [with bellows]," until when he had made it [like] fire, he said, "Bring me, that I may pour over it molten copper."

source: فما اسطاعوا أن يظهروه وما استطاعوا له نقبا
en: So Gog and Magog were unable to pass over it, nor were they able [to effect] in it any penetration.

source: قال هذا رحمة من ربي فإذا جاء وعد ربي جعله دكاء وكان وعد ربي حقا
en: [Dhul-Qarnayn] said, "This is a mercy from my Lord; but when the promise of my Lord comes, He will make it level, and ever is the promise of my Lord true."

source: وتركنا بعضهم يومئذ يموج في بعض ونفخ في الصور فجمعناهم جمعا
en: And We will leave them that day surging over each other, and [then] the Horn will be blown, and We will assemble them in [one] assembly.

source: وعرضنا جهنم يومئذ للكافرين عرضا
en: And We will present Hell that Day to the Disbelievers, on display -

source: الذين كانت أعينهم في غطاء عن ذكري وكانوا لا يستطيعون سمعا
en: Those whose eyes had been within a cover [removed] from My remembrance, and they were not able to hear.

source: أفحسب الذين كفروا أن يتخذوا عبادي من دوني أولياء إنا أعتدنا جهنم للكافرين نزلا
en: Then do those who disbelieve think that they can take My servants instead of Me as allies? Indeed, We have prepared Hell for the disbelievers as a lodging.

source: قل هل ننبئكم بالأخسرين أعمالا
en: Say, [O Muhammad], "Shall we [believers] inform you of the greatest losers as to [their] deeds?

source: الذين ضل سعيهم في الحياة الدنيا وهم يحسبون أنهم يحسنون صنعا
en: [They are] those whose effort is lost in worldly life, while they think that they are doing well in work."

source: أولئك الذين كفروا بآيات ربهم ولقائه فحبطت أعمالهم فلا نقيم لهم يوم القيامة وزنا
en: Those are the ones who disbelieve in the verses of their Lord and in [their] meeting Him, so their deeds have become worthless; and We will not assign to them on the Day of Resurrection any importance.

source: ذلك جزاؤهم جهنم بما كفروا واتخذوا آياتي ورسلي هزوا
en: That is their recompense - Hell - for what they denied and [because] they took My signs and My messengers in ridicule.

source: إن الذين آمنوا وعملوا الصالحات كانت لهم جنات الفردوس نزلا
en: Indeed, those who have believed and done righteous deeds - they will have the Gardens of Paradise as a lodging,

source: خالدين فيها لا يبغون عنها حولا
en: Wherein they abide eternally. They will not desire from it any transfer.

source: قل لو كان البحر مدادا لكلمات ربي لنفد البحر قبل أن تنفد كلمات ربي ولو جئنا بمثله مددا
en: Say, "If the sea were ink for [writing] the words of my Lord, the sea would be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement."

source: قل إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد فمن كان يرجو لقاء ربه فليعمل عملا صالحا ولا يشرك بعبادة ربه أحدا
en: Say, "I am only a man like you, to whom has been revealed that your god is one God. So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone."

source: كهيعص
en: Kaf, Ha, Ya, 'Ayn, Sad.

source: ذكر رحمت ربك عبده زكريا
en: [This is] a mention of the mercy of your Lord to His servant Zechariah

source: إذ نادى ربه نداء خفيا
en: When he called to his Lord a private supplication.

source: قال رب إني وهن العظم مني واشتعل الرأس شيبا ولم أكن بدعائك رب شقيا
en: He said, "My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.

source: وإني خفت الموالي من ورائي وكانت امرأتي عاقرا فهب لي من لدنك وليا
en: And indeed, I fear the successors after me, and my wife has been barren, so give me from Yourself an heir

source: يرثني ويرث من آل يعقوب واجعله رب رضيا
en: Who will inherit me and inherit from the family of Jacob. And make him, my Lord, pleasing [to You]."

source: يا زكريا إنا نبشرك بغلام اسمه يحيى لم نجعل له من قبل سميا
en: [He was told], "O Zechariah, indeed We give you good tidings of a boy whose name will be John. We have not assigned to any before [this] name."

source: قال رب أنى يكون لي غلام وكانت امرأتي عاقرا وقد بلغت من الكبر عتيا
en: He said, "My Lord, how will I have a boy when my wife has been barren and I have reached extreme old age?"

source: قال كذلك قال ربك هو علي هين وقد خلقتك من قبل ولم تك شيئا
en: [An angel] said, "Thus [it will be]; your Lord says, 'It is easy for Me, for I created you before, while you were nothing.' "

source: قال رب اجعل لي آية قال آيتك ألا تكلم الناس ثلاث ليال سويا
en: [Zechariah] said, "My Lord, make for me a sign." He said, "Your sign is that you will not speak to the people for three nights, [being] sound."

source: فخرج على قومه من المحراب فأوحى إليهم أن سبحوا بكرة وعشيا
en: So he came out to his people from the prayer chamber and signaled to them to exalt [Allah] in the morning and afternoon.

source: يا يحيى خذ الكتاب بقوة وآتيناه الحكم صبيا
en: [Allah] said, "O John, take the Scripture with determination." And We gave him judgement [while yet] a boy

source: وحنانا من لدنا وزكاة وكان تقيا
en: And affection from Us and purity, and he was fearing of Allah

source: وبرا بوالديه ولم يكن جبارا عصيا
en: And dutiful to his parents, and he was not a disobedient tyrant.

source: وسلام عليه يوم ولد ويوم يموت ويوم يبعث حيا
en: And peace be upon him the day he was born and the day he dies and the day he is raised alive.

source: واذكر في الكتاب مريم إذ انتبذت من أهلها مكانا شرقيا
en: And mention, [O Muhammad], in the Book [the story of] Mary, when she withdrew from her family to a place toward the east.

source: فاتخذت من دونهم حجابا فأرسلنا إليها روحنا فتمثل لها بشرا سويا
en: And she took, in seclusion from them, a screen. Then We sent to her Our Angel, and he represented himself to her as a well-proportioned man.

source: قالت إني أعوذ بالرحمن منك إن كنت تقيا
en: She said, "Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allah."

source: قال إنما أنا رسول ربك لأهب لك غلاما زكيا
en: He said, "I am only the messenger of your Lord to give you [news of] a pure boy."

source: قالت أنى يكون لي غلام ولم يمسسني بشر ولم أك بغيا
en: She said, "How can I have a boy while no man has touched me and I have not been unchaste?"

source: قال كذلك قال ربك هو علي هين ولنجعله آية للناس ورحمة منا وكان أمرا مقضيا
en: He said, "Thus [it will be]; your Lord says, 'It is easy for Me, and We will make him a sign to the people and a mercy from Us. And it is a matter [already] decreed.' "

source: فحملته فانتبذت به مكانا قصيا
en: So she conceived him, and she withdrew with him to a remote place.

source: فأجاءها المخاض إلى جذع النخلة قالت يا ليتني مت قبل هذا وكنت نسيا منسيا
en: And the pains of childbirth drove her to the trunk of a palm tree. She said, "Oh, I wish I had died before this and was in oblivion, forgotten."

source: فناداها من تحتها ألا تحزني قد جعل ربك تحتك سريا
en: But he called her from below her, "Do not grieve; your Lord has provided beneath you a stream.

source: وهزي إليك بجذع النخلة تساقط عليك رطبا جنيا
en: And shake toward you the trunk of the palm tree; it will drop upon you ripe, fresh dates.

source: فكلي واشربي وقري عينا فإما ترين من البشر أحدا فقولي إني نذرت للرحمن صوما فلن أكلم اليوم إنسيا
en: So eat and drink and be contented. And if you see from among humanity anyone, say, 'Indeed, I have vowed to the Most Merciful abstention, so I will not speak today to [any] man.' "

source: فأتت به قومها تحمله قالوا يا مريم لقد جئت شيئا فريا
en: Then she brought him to her people, carrying him. They said, "O Mary, you have certainly done a thing unprecedented.

source: يا أخت هارون ما كان أبوك امرأ سوء وما كانت أمك بغيا
en: O sister of Aaron, your father was not a man of evil, nor was your mother unchaste."

source: فأشارت إليه قالوا كيف نكلم من كان في المهد صبيا
en: So she pointed to him. They said, "How can we speak to one who is in the cradle a child?"

source: قال إني عبد الله آتاني الكتاب وجعلني نبيا
en: [Jesus] said, "Indeed, I am the servant of Allah. He has given me the Scripture and made me a prophet.

source: وجعلني مباركا أين ما كنت وأوصاني بالصلاة والزكاة ما دمت حيا
en: And He has made me blessed wherever I am and has enjoined upon me prayer and zakah as long as I remain alive

source: وبرا بوالدتي ولم يجعلني جبارا شقيا
en: And [made me] dutiful to my mother, and He has not made me a wretched tyrant.

source: والسلام علي يوم ولدت ويوم أموت ويوم أبعث حيا
en: And peace is on me the day I was born and the day I will die and the day I am raised alive."

source: ذلك عيسى ابن مريم قول الحق الذي فيه يمترون
en: That is Jesus, the son of Mary - the word of truth about which they are in dispute.

source: ما كان لله أن يتخذ من ولد سبحانه إذا قضى أمرا فإنما يقول له كن فيكون
en: It is not [befitting] for Allah to take a son; exalted is He! When He decrees an affair, He only says to it, "Be," and it is.

source: وإن الله ربي وربكم فاعبدوه هذا صراط مستقيم
en: [Jesus said], "And indeed, Allah is my Lord and your Lord, so worship Him. That is a straight path."

source: فاختلف الأحزاب من بينهم فويل للذين كفروا من مشهد يوم عظيم
en: Then the factions differed [concerning Jesus] from among them, so woe to those who disbelieved - from the scene of a tremendous Day.

source: أسمع بهم وأبصر يوم يأتوننا لكن الظالمون اليوم في ضلال مبين
en: How [clearly] they will hear and see the Day they come to Us, but the wrongdoers today are in clear error.

source: وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة وهم لا يؤمنون
en: And warn them, [O Muhammad], of the Day of Regret, when the matter will be concluded; and [yet], they are in [a state of] heedlessness, and they do not believe.

source: إنا نحن نرث الأرض ومن عليها وإلينا يرجعون
en: Indeed, it is We who will inherit the earth and whoever is on it, and to Us they will be returned.

source: واذكر في الكتاب إبراهيم إنه كان صديقا نبيا
en: And mention in the Book [the story of] Abraham. Indeed, he was a man of truth and a prophet.

source: إذ قال لأبيه يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا
en: [Mention] when he said to his father, "O my father, why do you worship that which does not hear and does not see and will not benefit you at all?

source: يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطا سويا
en: O my father, indeed there has come to me of knowledge that which has not come to you, so follow me; I will guide you to an even path.

source: يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا
en: O my father, do not worship Satan. Indeed Satan has ever been, to the Most Merciful, disobedient.

source: يا أبت إني أخاف أن يمسك عذاب من الرحمن فتكون للشيطان وليا
en: O my father, indeed I fear that there will touch you a punishment from the Most Merciful so you would be to Satan a companion [in Hellfire]."

source: قال أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا
en: [His father] said, "Have you no desire for my gods, O Abraham? If you do not desist, I will surely stone you, so avoid me a prolonged time."

source: قال سلام عليك سأستغفر لك ربي إنه كان بي حفيا
en: [Abraham] said, "Peace will be upon you. I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me.

source: وأعتزلكم وما تدعون من دون الله وأدعو ربي عسى ألا أكون بدعاء ربي شقيا
en: And I will leave you and those you invoke other than Allah and will invoke my Lord. I expect that I will not be in invocation to my Lord unhappy."

source: فلما اعتزلهم وما يعبدون من دون الله وهبنا له إسحاق ويعقوب وكلا جعلنا نبيا
en: So when he had left them and those they worshipped other than Allah, We gave him Isaac and Jacob, and each [of them] We made a prophet.

source: ووهبنا لهم من رحمتنا وجعلنا لهم لسان صدق عليا
en: And We gave them of Our mercy, and we made for them a reputation of high honor.

source: واذكر في الكتاب موسى إنه كان مخلصا وكان رسولا نبيا
en: And mention in the Book, Moses. Indeed, he was chosen, and he was a messenger and a prophet.

source: وناديناه من جانب الطور الأيمن وقربناه نجيا
en: And We called him from the side of the mount at [his] right and brought him near, confiding [to him].

source: ووهبنا له من رحمتنا أخاه هارون نبيا
en: And We gave him out of Our mercy his brother Aaron as a prophet.

source: واذكر في الكتاب إسماعيل إنه كان صادق الوعد وكان رسولا نبيا
en: And mention in the Book, Ishmael. Indeed, he was true to his promise, and he was a messenger and a prophet.

source: وكان يأمر أهله بالصلاة والزكاة وكان عند ربه مرضيا
en: And he used to enjoin on his people prayer and zakah and was to his Lord pleasing.

source: واذكر في الكتاب إدريس إنه كان صديقا نبيا
en: And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.

source: ورفعناه مكانا عليا
en: And We raised him to a high station.

source: أولئك الذين أنعم الله عليهم من النبيين من ذرية آدم وممن حملنا مع نوح ومن ذرية إبراهيم وإسرائيل وممن هدينا واجتبينا إذا تتلى عليهم آيات الرحمن خروا سجدا وبكيا
en: Those were the ones upon whom Allah bestowed favor from among the prophets of the descendants of Adam and of those We carried [in the ship] with Noah, and of the descendants of Abraham and Israel, and of those whom We guided and chose. When the verses of the Most Merciful were recited to them, they fell in prostration and weeping.

source: فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا
en: But there came after them successors who neglected prayer and pursued desires; so they are going to meet evil -

source: إلا من تاب وآمن وعمل صالحا فأولئك يدخلون الجنة ولا يظلمون شيئا
en: Except those who repent, believe and do righteousness; for those will enter Paradise and will not be wronged at all.

source: جنات عدن التي وعد الرحمن عباده بالغيب إنه كان وعده مأتيا
en: [Therein are] gardens of perpetual residence which the Most Merciful has promised His servants in the unseen. Indeed, His promise has ever been coming.

source: لا يسمعون فيها لغوا إلا سلاما ولهم رزقهم فيها بكرة وعشيا
en: They will not hear therein any ill speech - only [greetings of] peace - and they will have their provision therein, morning and afternoon.

source: تلك الجنة التي نورث من عبادنا من كان تقيا
en: That is Paradise, which We give as inheritance to those of Our servants who were fearing of Allah.

source: وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا وما بين ذلك وما كان ربك نسيا
en: [Gabriel said], "And we [angels] descend not except by the order of your Lord. To Him belongs that before us and that behind us and what is in between. And never is your Lord forgetful -

source: رب السماوات والأرض وما بينهما فاعبده واصطبر لعبادته هل تعلم له سميا
en: Lord of the heavens and the earth and whatever is between them - so worship Him and have patience for His worship. Do you know of any similarity to Him?"

source: ويقول الإنسان أإذا ما مت لسوف أخرج حيا
en: And the disbeliever says, "When I have died, am I going to be brought forth alive?"

source: أولا يذكر الإنسان أنا خلقناه من قبل ولم يك شيئا
en: Does man not remember that We created him before, while he was nothing?

source: فوربك لنحشرنهم والشياطين ثم لنحضرنهم حول جهنم جثيا
en: So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees.

source: ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا
en: Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence.

source: ثم لنحن أعلم بالذين هم أولى بها صليا
en: Then, surely it is We who are most knowing of those most worthy of burning therein.

source: وإن منكم إلا واردها كان على ربك حتما مقضيا
en: And there is none of you except he will come to it. This is upon your Lord an inevitability decreed.

source: ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا
en: Then We will save those who feared Allah and leave the wrongdoers within it, on their knees.

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للذين آمنوا أي الفريقين خير مقاما وأحسن نديا
en: And when Our verses are recited to them as clear evidences, those who disbelieve say to those who believe, "Which of [our] two parties is best in position and best in association?"

source: وكم أهلكنا قبلهم من قرن هم أحسن أثاثا ورئيا
en: And how many a generation have We destroyed before them who were better in possessions and [outward] appearance?

source: قل من كان في الضلالة فليمدد له الرحمن مدا حتى إذا رأوا ما يوعدون إما العذاب وإما الساعة فسيعلمون من هو شر مكانا وأضعف جندا
en: Say, "Whoever is in error - let the Most Merciful extend for him an extension [in wealth and time] until, when they see that which they were promised - either punishment [in this world] or the Hour [of resurrection] - they will come to know who is worst in position and weaker in soldiers."

source: ويزيد الله الذين اهتدوا هدى والباقيات الصالحات خير عند ربك ثوابا وخير مردا
en: And Allah increases those who were guided, in guidance, and the enduring good deeds are better to your Lord for reward and better for recourse.

source: أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا
en: Then, have you seen he who disbelieved in Our verses and said, "I will surely be given wealth and children [in the next life]?"

source: أطلع الغيب أم اتخذ عند الرحمن عهدا
en: Has he looked into the unseen, or has he taken from the Most Merciful a promise?

source: كلا سنكتب ما يقول ونمد له من العذاب مدا
en: No! We will record what he says and extend for him from the punishment extensively.

source: ونرثه ما يقول ويأتينا فردا
en: And We will inherit him [in] what he mentions, and he will come to Us alone.

source: واتخذوا من دون الله آلهة ليكونوا لهم عزا
en: And they have taken besides Allah [false] deities that they would be for them [a source of] honor.

source: كلا سيكفرون بعبادتهم ويكونون عليهم ضدا
en: No! Those "gods" will deny their worship of them and will be against them opponents [on the Day of Judgement].

source: ألم تر أنا أرسلنا الشياطين على الكافرين تؤزهم أزا
en: Do you not see that We have sent the devils upon the disbelievers, inciting them to [evil] with [constant] incitement?

source: فلا تعجل عليهم إنما نعد لهم عدا
en: So be not impatient over them. We only count out to them a [limited] number.

source: يوم نحشر المتقين إلى الرحمن وفدا
en: On the Day We will gather the righteous to the Most Merciful as a delegation

source: ونسوق المجرمين إلى جهنم وردا
en: And will drive the criminals to Hell in thirst

source: لا يملكون الشفاعة إلا من اتخذ عند الرحمن عهدا
en: None will have [power of] intercession except he who had taken from the Most Merciful a covenant.

source: وقالوا اتخذ الرحمن ولدا
en: And they say, "The Most Merciful has taken [for Himself] a son."

source: لقد جئتم شيئا إدا
en: You have done an atrocious thing.

source: تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا
en: The heavens almost rupture therefrom and the earth splits open and the mountains collapse in devastation

source: أن دعوا للرحمن ولدا
en: That they attribute to the Most Merciful a son.

source: وما ينبغي للرحمن أن يتخذ ولدا
en: And it is not appropriate for the Most Merciful that He should take a son.

source: إن كل من في السماوات والأرض إلا آتي الرحمن عبدا
en: There is no one in the heavens and earth but that he comes to the Most Merciful as a servant.

source: لقد أحصاهم وعدهم عدا
en: He has enumerated them and counted them a [full] counting.

source: وكلهم آتيه يوم القيامة فردا
en: And all of them are coming to Him on the Day of Resurrection alone.

source: إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا
en: Indeed, those who have believed and done righteous deeds - the Most Merciful will appoint for them affection.

source: فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا
en: So, [O Muhammad], We have only made Qur'an easy in the Arabic language that you may give good tidings thereby to the righteous and warn thereby a hostile people.

source: وكم أهلكنا قبلهم من قرن هل تحس منهم من أحد أو تسمع لهم ركزا
en: And how many have We destroyed before them of generations? Do you perceive of them anyone or hear from them a sound?

source: طه
en: Ta, Ha.

source: ما أنزلنا عليك القرآن لتشقى
en: We have not sent down to you the Qur'an that you be distressed

source: إلا تذكرة لمن يخشى
en: But only as a reminder for those who fear [Allah] -

source: تنزيلا ممن خلق الأرض والسماوات العلى
en: A revelation from He who created the earth and highest heavens,

source: الرحمن على العرش استوى
en: The Most Merciful [who is] above the Throne established.

source: له ما في السماوات وما في الأرض وما بينهما وما تحت الثرى
en: To Him belongs what is in the heavens and what is on the earth and what is between them and what is under the soil.

source: وإن تجهر بالقول فإنه يعلم السر وأخفى
en: And if you speak aloud - then indeed, He knows the secret and what is [even] more hidden.

source: الله لا إله إلا هو له الأسماء الحسنى
en: Allah - there is no deity except Him. To Him belong the best names.

source: وهل أتاك حديث موسى
en: And has the story of Moses reached you? -

source: إذ رأى نارا فقال لأهله امكثوا إني آنست نارا لعلي آتيكم منها بقبس أو أجد على النار هدى
en: When he saw a fire and said to his family, "Stay here; indeed, I have perceived a fire; perhaps I can bring you a torch or find at the fire some guidance."

source: فلما أتاها نودي يا موسى
en: And when he came to it, he was called, "O Moses,

source: إني أنا ربك فاخلع نعليك إنك بالواد المقدس طوى
en: Indeed, I am your Lord, so remove your sandals. Indeed, you are in the sacred valley of Tuwa.

source: وأنا اخترتك فاستمع لما يوحى
en: And I have chosen you, so listen to what is revealed [to you].

source: إنني أنا الله لا إله إلا أنا فاعبدني وأقم الصلاة لذكري
en: Indeed, I am Allah. There is no deity except Me, so worship Me and establish prayer for My remembrance.

source: إن الساعة آتية أكاد أخفيها لتجزى كل نفس بما تسعى
en: Indeed, the Hour is coming - I almost conceal it - so that every soul may be recompensed according to that for which it strives.

source: فلا يصدنك عنها من لا يؤمن بها واتبع هواه فتردى
en: So do not let one avert you from it who does not believe in it and follows his desire, for you [then] would perish.

source: وما تلك بيمينك يا موسى
en: And what is that in your right hand, O Moses?"

source: قال هي عصاي أتوكأ عليها وأهش بها على غنمي ولي فيها مآرب أخرى
en: He said, "It is my staff; I lean upon it, and I bring down leaves for my sheep and I have therein other uses."

source: قال ألقها يا موسى
en: [Allah] said, "Throw it down, O Moses."

source: فألقاها فإذا هي حية تسعى
en: So he threw it down, and thereupon it was a snake, moving swiftly.

source: قال خذها ولا تخف سنعيدها سيرتها الأولى
en: [Allah] said, "Seize it and fear not; We will return it to its former condition.
